## Plan Result (dev-frontdoor)




<pre><code>Plan: 0 to add, 25 to change, 0 to destroy.</code></pre>

* Update
  * azurerm_resource_group.fd_rg
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;dev-casetracker&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;dev-certificatedbailiffs&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;dev-courtfines&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;dev-immigrationappealsonline&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;dev-trib-admin-appeals&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;dev-trib-care-standards&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;dev-trib-cicap&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;dev-trib-employment-appeals&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;dev-trib-finance-tax&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;dev-trib-immigration-svcs&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;dev-trib-info-rights&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;dev-trib-land-reg-division&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;dev-trib-lands-chamber&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;dev-trib-tansport-appeals&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;jd-bureau&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;jd-public&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;sds-api-mgmt&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;toffee&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;vh-admin-web&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;vh-test-web&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;vh-video-web&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;vh-video-web-reform&#34;]
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.fd_rg will be updated in-place
  ~ resource "azurerm_resource_group" "fd_rg" {
        id       = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg"
        name     = "lz-dev-rg"
      ~ tags     = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                   = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev"
        name                                 = "sdshmcts-dev"
      ~ tags                                 = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (129 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["dev-casetracker"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devcasetrackerdev"
        name                              = "devcasetrackerdev"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["dev-certificatedbailiffs"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devcertificatedbailiffsdev"
        name                              = "devcertificatedbailiffsdev"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["dev-courtfines"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devcourtfinesdev"
        name                              = "devcourtfinesdev"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["dev-immigrationappealsonline"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devimmigrationappealsonlinedev"
        name                              = "devimmigrationappealsonlinedev"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["dev-trib-admin-appeals"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devtribadminappealsdev"
        name                              = "devtribadminappealsdev"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["dev-trib-care-standards"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devtribcarestandardsdev"
        name                              = "devtribcarestandardsdev"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["dev-trib-cicap"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devtribcicapdev"
        name                              = "devtribcicapdev"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["dev-trib-employment-appeals"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devtribemploymentappealsdev"
        name                              = "devtribemploymentappealsdev"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["dev-trib-finance-tax"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devtribfinancetaxdev"
        name                              = "devtribfinancetaxdev"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["dev-trib-immigration-svcs"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devtribimmigrationsvcsdev"
        name                              = "devtribimmigrationsvcsdev"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["dev-trib-info-rights"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devtribinforightsdev"
        name                              = "devtribinforightsdev"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["dev-trib-land-reg-division"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devtriblandregdivisiondev"
        name                              = "devtriblandregdivisiondev"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["dev-trib-lands-chamber"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devtriblandschamberdev"
        name                              = "devtriblandschamberdev"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["dev-trib-tansport-appeals"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/devtribtansportappealsdev"
        name                              = "devtribtansportappealsdev"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["jd-bureau"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/jdbureaudev"
        name                              = "jdbureaudev"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["jd-public"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/jdpublicdev"
        name                              = "jdpublicdev"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["sds-api-mgmt"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/sdsapimgmtdev"
        name                              = "sdsapimgmtdev"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["toffee"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/toffeedev"
        name                              = "toffeedev"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["vh-admin-web"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/vhadminwebdev"
        name                              = "vhadminwebdev"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["vh-test-web"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/vhtestwebdev"
        name                              = "vhtestwebdev"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["vh-video-web"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/vhvideowebdev"
        name                              = "vhvideowebdev"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["vh-video-web-reform"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/vhvideowebreformdev"
        name                              = "vhvideowebreformdev"
      ~ tags                              = {
          + "autoShutdown" = "false"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/lz-dev-rg/providers/Microsoft.Network/frontDoors/sdshmcts-dev|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - log {
          - category = "FrontdoorAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "FrontdoorWebApplicationFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category       = (known after apply)
          + category_group = (known after apply)
          + enabled        = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 0 to add, 25 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":344,"Program":"tfcmt","SHA1":"","Target":"dev-frontdoor","Vars":{}} -->